# HomewWork2
# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх
# одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть
import random

a = int(input("Введите кол-во монеток которое хотите вы взяли в руку и решили подкинуть: "))
b = [random.randint(0,1) for i in range(a)]
eagle = 0
tails = 0
print("Монетки приземлились на стол - ",b)

# через for
for i in range(len(b)):
    if b[i] == 1:
        eagle += 1
    if b[i] == 0:
        tails += 1

# через while
i = 0
eagle = 0
tails = 0
print(b)
while len(b) > i:
    if b[i] == 1:
        eagle += 1
    if b[i] == 0:
        tails += 1
    i += 1


print(f'У нас получилось Орёл - {eagle}шт и Решка - {tails}шт')

# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

a = int(input("Ввведите сумму натуральных чисел: "))
b = int(input())

for i in range(a): # берем i = 0 и дальше внутри цикла мы будем прибавлять к i + 1
    for j in range(b): # берем j = 0 и прибавляем внутри цикла к j + 1  до числа в переменной b до тех пор пока
# условия не будут соблюдены, при выходе из цикла мы вернемся к циклу for i, где прибавим +1 и будем сравнивать опять
        if i + j == a and i * j == b: # Условия № 1
            print(f"Мы отгдалаи !!! Это число {i} и {j}")


# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

a = int(input("введите целое число что бы вывести все целые степени двойки: "))
b = 0

# через while
while 2 ** b < a: # будем выполнять цикл до тех пор пока у
    print(2 ** b, end=" ") # здесь мы не переходим на новую строку
    b += 1
    if 2 ** b >= a:
        print(f"- Все степени двойки от 1 до {a}")


# через for
for i in range(a):
    if 2 ** b < a:
        print(2 ** b, end=" ")
        b += 1
        if 2 ** b >= a:
            print(f"- Все целые степени двойки от 1 до {a}")


# через функцию c использованием массива

def arrSum(a):
    w = a
    c = []
    b = 0
    for i in range(a):
        if 2 ** b <= a:
            c.append(2 ** b)
            b += 1
    return  print(f"{c}- Все целые степени двойки от 1 до {w}")

arrSum(a)